#+title: Replace Vector Prims
#+date: <2023-01-17 15:00>
#+description: A quick and hopefully temporary shim to treat other things as vectors.
#+filetags:

To make =stage0= for Gerbil work in JavaScript we will try and fudge the ##vector-* usage.

** The runtime! =gx-gambc0=

In this file there are many uses of =%%vector-= macros.

#+begin_src sh :results verbatim :wrap example
  export GERBIL_GSI=~/me/MuKn/src/gerbil.js/gambit/bin/gsi-js
  export GERBIL_SRC=~/me/MuKn/src/gerbil.js/gerbil

  cd $GERBIL_SRC/src/gerbil/runtime
  $GERBIL_GSI -e '(include "./gx-gambc#.scm")' ./gx-gambc0.scm
#+end_src
*=>*
#+begin_example
,*** ERROR IN gerbil-runtime-smp?, "gx-gambc0.scm"@34.8 -- Attempting ##vector-ref on non-vector: #<thread-group #2 primordial>
>
,*** EOF again to exit
#+end_example


We'll get rid of them.


#+begin_src sh :results verbatim :wrap src js
  export GERBIL_SRC=~/me/MuKn/src/gerbil.js/gerbil
  export GX0=$GERBIL_SRC/src/gerbil/runtime/gx-gambc0.scm
  SEDME="s|%%vector|%%structor|g"

  echo "Sed'ing $GX0"
  sed -i $SEDME $GX0
#+end_src

#+RESULTS:
#+begin_src js
Sed'ing /home/drewc/me/MuKn/src/gerbil.js/gerbil/src/gerbil/runtime/gx-gambc0.scm
#+end_src

Now?
#+begin_src sh :results verbatim :wrap example
  export GERBIL_GSI=~/me/MuKn/src/gerbil.js/gambit/bin/gsi-js
  export GERBIL_SRC=~/me/MuKn/src/gerbil.js/gerbil

  cd $GERBIL_SRC/src/gerbil/runtime
  $GERBIL_GSI -e '(include "./gx-gambc#.scm")' ./gx-gambc0.scm\
              -e '(displayln "Try out error? " (error? (##structure error::t)))'
#+end_src

#+RESULTS:
#+begin_example
Try out error? #t
#+end_example

*** Primitive ~eval~

Gerbil has, well:

#+begin_quote
 This is a primitive eval that can be used to bootstrap the Gerbil expander directly from source (without an expander bootstrap).  It was used in early Gerbil, and could be used again if you want to (painfully) bootstrap the expander from source again, perhaps for trust purposes.
#+end_quote

Because we are a few files before the expander bootstrap having a working Gerbil is not a bad idea.

#+begin_src scheme :tangle test-gambc1.scm
  (displayln "This is a test for gx-gambc1: The AST")
  (define syns (read-syntax-from-file "./gx-version.scm"))
  (display* "Have Syntax: " syns "which prints as\n\t")
  (map _gx#pp-syntax syns)
  (define (text-gvs) "0.17.0-666-hahaha")
  (displayln "What is here? :" &context::t " and " _gx#eval)
#+end_src

*Gerbil* has =cond-expand gerbil-bootstrap-expander= so we need to define it. When we have that defined there is a ~_gx#eval~ that needs a compiler. We don't yet have that so onto =gx-gambc2=
#+begin_src sh :results verbatim :wrap example
      export GERBIL_GSI=~/me/MuKn/src/gerbil.js/gambit/bin/gsi-js
      export GERBIL_SRC=~/me/MuKn/src/gerbil.js/gerbil


      PRELUDE="(define-cond-expand-feature|gerbil-bootstrap-expander|)"

      testfile=$(pwd)/test-gambc1.scm

      cd $GERBIL_SRC/src/gerbil/runtime

      $GERBIL_GSI -e $PRELUDE -e '(include "./gx-gambc#.scm")' \
                  ./gx-gambc0.scm ./gx-gambc1.scm\
                  $testfile
#+end_src

#+RESULTS:
#+begin_example
This is a test for gx-gambc1: The AST
Have Syntax: (#<syntax #2>)which prints as
(define (gerbil-version-string) "0.17.0-66-g605e6fd6")
	What is here? :#<type #3 &context> and #<procedure #4 _gx#eval>
#+end_example

** =gx-gambc2=, the compiler


#+begin_src scheme :tangle test-gambc2.scm
  (displayln "This is a test for gx-gambc2: The compiler")
  (define syns (read-syntax-from-file "./gx-version.scm"))
  (display* "Have Syntax: " syns "which prints as\n\t")
  (map _gx#pp-syntax syns)
  (define (text-gvs) "0.17.0-666-hahaha")
  (displayln "What is here? :" &context::t " and " _gx#eval
             "\n\tand finally " _gx#compile "in)
  (display (map _gx#compile syns))
#+end_src
#+begin_src sh :results verbatim :wrap example
      export GERBIL_GSI=~/me/MuKn/src/gerbil.js/gambit/bin/gsi-js
      export GERBIL_SRC=~/me/MuKn/src/gerbil.js/gerbil


      PRELUDE="(define-cond-expand-feature|gerbil-bootstrap-expander|)"

      testfile=$(pwd)/test-gambc2.scm

      cd $GERBIL_SRC/src/gerbil/runtime

      $GERBIL_GSI -e $PRELUDE -e '(include "./gx-gambc#.scm")' \
                  ./gx-gambc0.scm ./gx-gambc1.scm ./gx-gambc2.scm \
                  $testfile
#+end_src

#+RESULTS:
#+begin_example
This is a test for gx-gambc2: The compiler
Have Syntax: (#<syntax #2>)which prints as
(define (gerbil-version-string) "0.17.0-66-g605e6fd6")
	What is here? :#<type #3 &context> and #<procedure #4 _gx#eval>
	and finally #<procedure #5 _gx#compile>
,*** ERROR IN map -- This object was raised: #<syntax-error #6>
>
,*** EOF again to exit
#+end_example

** Sed the bootstrap

#+begin_src sh :results verbatim :wrap example
  export GERBIL_SRC=~/me/MuKn/src/gerbil.js/gerbil
  StarSed() {
      echo "s/##vector-$1/_gx#vector-$1/g"
  }
  cd $GERBIL_SRC/src/bootstrap/
  find . -name "*.scm" -exec sed -i "$(StarSed ref)" {} \;
  find . -name "*.scm" -exec sed -i "$(StarSed set!)" {} \;
  find . -name "*.scm" -exec sed -i "$(StarSed length)" {} \;
  find . -name "*.scm" -exec sed -i "$(StarSed '>list')" {} \;
#+end_src

#+RESULTS:
#+begin_example
#+end_example

  #+begin_src sh :results verbatim :wrap example
    export GERBIL_SRC=~/me/MuKn/src/gerbil.js/gerbil
    export GERBIL_GSI=~/me/MuKn/src/gerbil.js/gambit/bin/gsi-js
    cd $GERBIL_SRC/src/gerbil/runtime

    PRELUDE="(define-cond-expand-feature|gerbil-bootstrap-expander|)"

    testfile=$(pwd)/test-gx-vector.scm


    $GERBIL_GSI -e $PRELUDE -e '(include "./gx-gambc#.scm")' \
                ./gx-gambc0.scm ./gx-gambc1.scm ./gx-gambc2.scm \
                $testfile
#+end_src


** Test it
  #+begin_src sh :results verbatim :wrap example
    export GERBIL_SRC=../gerbil
    export GERBIL_GSI=$GERBIL_SRC/src/gerbil/gsi-js
    export GERBIL_HOME=$GERBIL_SRC/bootstrap

    $GERBIL_HOME/bin/gxi -e '(display* "The Answer to LTUAE is?" 42)' 2>&1 || true
#+end_src

*ERROR*

#+begin_example
,*** ERROR IN make-object -- Tried %%structor-set! on non-structure:  #(#f #f #f #f #f #f)
>
,*** EOF again to exit
#+end_example


Seen that before. This is the replacement.

#+begin_src scheme
  (define (make-object klass k)
    (let ((obj (%%make-structure (%%fx+ k 1) #f)))
      (%%unchecked-structure-set! obj klass 0 ##type-type make-object)
      obj))
#+end_src


Now?

  #+begin_src sh :results verbatim :wrap example
        export GERBIL_GSC=~/me/MuKn/src/gerbil.js/gambit/gsc/gsc
        export GERBIL_SRC=~/me/MuKn/src/gerbil.js/gerbil

        cd $GERBIL_SRC/src/ && ./build.sh gxi
        cd $GERBIL_SRC/src/ && ./build.sh stage0
#+end_src

Test it


  #+begin_src sh :results verbatim :wrap example
    export GERBIL_SRC=../gerbil
    export GERBIL_GSI=$GERBIL_SRC/src/gerbil/gsi-js
    export GERBIL_HOME=$GERBIL_SRC/bootstrap

    $GERBIL_HOME/bin/gxi -e '(display* "The Answer to LTUAE is?" 42)' 2>&1 || true
#+end_src
*=> ERROR*
#+begin_example
,*** ERROR IN gx#root-context:::init!__% -- struct-instance-init!: too many arguments for struct #<root-context #2>
>
,*** EOF again to exit
#+end_example

And that's what I thought I'd fixed with all the _gx# shims. Fuck.
#+begin_src sh :results verbatim :wrap example
  find ../gerbil -name '*.scm' -exec grep -Hi 'def.* gx#root-context:::init!__%' {} \;
#+end_src

#+RESULTS:
#+begin_example
../gerbil/src/bootstrap/gerbil/expander/root__0.scm:  (define gx#root-context:::init!__%
../gerbil/bootstrap/lib/gerbil/expander/root__0.scm:  (define gx#root-context:::init!__%
#+end_example

I get it! Finally tracked that down.

#+begin_src scheme
(define (make-object klass k) (%%make-structure klass (%%fx+ k 1)))
#+end_src

#+begin_src sh :results verbatim :wrap example
        export GERBIL_GSC=~/me/MuKn/src/gerbil.js/gambit/gsc/gsc
        export GERBIL_SRC=~/me/MuKn/src/gerbil.js/gerbil

        cd $GERBIL_SRC/src/ && ./build.sh gxi
        cd $GERBIL_SRC/src/ && ./build.sh stage0
#+end_src
Now?
  #+begin_src sh :results verbatim :wrap example
    export GERBIL_SRC=../gerbil
    export GERBIL_GSI=$GERBIL_SRC/src/gerbil/gsi-js
    export GERBIL_HOME=$GERBIL_SRC/bootstrap

    $GERBIL_HOME/bin/gxi -e '(display* "The Answer to LTUAE is?" 42)' 2>&1 || true
#+end_src

#+RESULTS:
#+begin_example
,*** ERROR IN gx#core-bind!__% -- core bond 0
>
,*** EOF again to exit
#+end_example

*=> ERROR*
#+begin_example
,*** ERROR IN gx#core-bind!__% -- (Argument 1) Instance of #<type #2 table> expected
(table-ref 'phi-context 'runtime-type-exhibitor-e #f)
>
,*** EOF again to exit
#+end_example


Well that's new! It seems to be an off by one error.


#+begin_src sh :results verbatim :wrap example
  find ../gerbil -name '*.scm' -exec grep -Hi 'def.* gx#core-bind!__%' {} \;
#+end_src

#+RESULTS:
#+begin_example
../gerbil/src/bootstrap/gerbil/expander/core__0.scm:  (define gx#core-bind!__%
../gerbil/bootstrap/lib/gerbil/expander/core__0.scm:  (define gx#core-bind!__%
#+end_example

#+begin_src sh :results verbatim :wrap example
        export GERBIL_GSC=~/me/MuKn/src/gerbil.js/gambit/gsc/gsc
        export GERBIL_SRC=~/me/MuKn/src/gerbil.js/gerbil

        cd $GERBIL_SRC/src/ && ./build.sh gxi
        cd $GERBIL_SRC/src/ && ./build.sh stage0
 #+end_src
#+begin_src sh :results verbatim :wrap example
    export GERBIL_SRC=../gerbil
    export GERBIL_GSI=$GERBIL_SRC/src/gerbil/gsi-js
    export GERBIL_HOME=$GERBIL_SRC/bootstrap

    $GERBIL_HOME/bin/gxi -e '(display* "The Answer to LTUAE is?" 42)' 2>&1 || true
#+end_src

#+RESULTS:
#+begin_example
,*** ERROR IN gx#core-bind!__% -- (Argument 1) Instance of #<type #2 table> expected
(table-ref 'phi-context 'runtime-type-exhibitor-e #f)
>
,*** EOF again to exit
#+end_example


That will end my adventure today.
